##### Simple APIs

An API lets 2 pieces of software talk to each other. E.g, your API connects your program to other software components, you dont have to know how the API works, just as inputs and outputs.

Pandas is a set of software components, much of which are not written in Python. We use the Pandas API to process the data by communicating with the other software components. (Your Python Program > Pandas object > other software component).

When you create a dictionary, and then create a pandas object with a DataFrame constructor in API lingo, this is an Instance.
The data in the dictionary is parsed along to the pandas API. We then use the DataFrame to communicate with the API.
When you call the method head, the DataFrame communicates with the API

In [10]:
import pandas as pd

In [11]:
dict_={'a':[11,21,31], 'b':[12,22,32]}

In [3]:
df = pd.DataFrame(dict_)

In [12]:
df.head()

    a   b
0  11  12
1  21  22
2  31  32

In [5]:
df.mean()

a    21.0
b    22.0
dtype: float64

##### REST APIs

They are aother type of APIs. They allow you to communicate with the internet. Allowing you to take advantage of resources like storage, access more data, artificial intelligence algorithms etc.
RE = Representational
S = State
T = Transfer

In REST API, the program is called client
REST APIs are used to interact with web services, i.e, Applications that you call through the internet. They have a set of rules regarding:
Communication
Input or Request
Output or Response

Some Terms:

You or your code can be thought of as the CLIENT.
The web service is referred to as the RESOURCE.
The client finds the resource at the end point. The client sends request to the resource in response to the client.

HTTP methods are ways of transmitting data over the internet. We tell the REST API what to do by sending a request. The request is usually communicated via an HTTP message.The HTTP message usually contains a Jason file. This contains instruction for what operation we would like the service to perform. This operation is transmitted to the web service via the internet. The service performs the operation.In a similar manner, the web service returns a response via an HTTP message, where the info is usually returned via Jason file. This info is usually transmitted back to the client.

Sports Data is always changing.It's an excellent application of API as it's constantly updated. To make a request for a sprcific team is simple. You dont require a JSON file. All we reqire is an ID. This info is stored locally in the API. We import the teams. The mtd get_teams returns a list of dictionaries which are. 
The dictionary key ID has a unique identifier for each team as a value.
To make things easier, we can convert the dictionary to a table

In [13]:
!pip install nba_api
from nba_api.stats.static import teams
nba_teams = teams.get_teams()
nba_teams[5]

Requirement already satisfied: nba_api in c:\users\user\anaconda3\lib\site-packages (1.1.11)
Requirement already satisfied: requests in c:\users\user\anaconda3\lib\site-packages (from nba_api) (2.27.1)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\user\anaconda3\lib\site-packages (from requests->nba_api) (2021.10.8)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\user\anaconda3\lib\site-packages (from requests->nba_api) (1.26.9)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\anaconda3\lib\site-packages (from requests->nba_api) (3.3)
Requirement already satisfied: charset-normalizer~=2.0.0 in c:\users\user\anaconda3\lib\site-packages (from requests->nba_api) (2.0.4)

{'id': 1610612742,
 'full_name': 'Dallas Mavericks',
 'abbreviation': 'DAL',
 'nickname': 'Mavericks',
 'city': 'Dallas',
 'state': 'Texas',
 'year_founded': 1980}

In [16]:
def one_dict(list_dict):
    keys=list_dict[0].keys()
    out_dict={key:[]for key in keys}
    for dict_in list_dict:
        for key, value in dict_.items():
            out_dict[key].append(value)
            return out_dict
        dict_nba_team = one_dict(nba_teams)
        df_teams=pd.DataFrame(dict_nba_team)
        df_teams.head()

SyntaxError: invalid syntax (1275374366.py, line 4)

In [18]:
# To find the row that contains the warriors

df_warriors=df_teams[df_teams['nickname']=='warriors]
                     
df_warriors

SyntaxError: EOL while scanning string literal (3698460412.py, line 3)

In [19]:
# To access the 1st column of the DataFrame

id_warriors=df_warriors[['id']].values[0][0]

NameError: name 'df_warriors' is not defined

In [20]:
# The game finder uses themethod get DataFrame that returns the DataFrame
# The DataFrame contains all the games the warriors played. VS=Home game and @=Away game
# 

games = gamefinder.get_data_frames()[0]
games.head()

NameError: name 'gamefinder' is not defined

In [21]:
games_home = games[games['MATCHUP']=='GSW vs.TOR']

NameError: name 'games' is not defined

In [22]:
games_away = games[games['MATCHUP']=='GSW vs.TOR']

NameError: name 'games' is not defined

In [23]:
# We can plot the + and - column of both DataFrames

import matplotlib as pyplot.plt

fig,ax = plt.subplots()
games_away.plot(x='GAME_DATE',y='PLUS_MINUS',ax=ax)
games_home.plot(x='GAME_DATE',y='PLUS_MINUS',ax=ax)
ax.legend(["away","home"])

plt.show

SyntaxError: invalid syntax (4274238950.py, line 3)

##### READING DATA FROM DATABASES

In [24]:
import pandas as pd

##### Read Data From SQL Database

In [25]:
import sqlite3

In [26]:
conn = sqlite3.connect('C:\\Users\\user\\Downloads\\chinook.db')

# Once we have a Connection object, we can then create a Cursor object. Cursors allow us to execute SQL queries against a database:

In [27]:
cur = conn.cursor()

# The Cursor created has a method execute, which will receive SQL parameters to run against the database.

# The code below will fetch the 1st 5 rows from the employees table:

In [28]:
cur.execute('SELECT * FROM employees LIMIT 5;')

# You may have noticed that we didn't assign the result of the above query to a variable. This is because we need to run
# another command to actually fetch the results.
# We can use the fetchall method to fetch all the of the results of a query:

In [29]:
results = cur.fetchall()

In [30]:
results

[(1,
  'Adams',
  'Andrew',
  'General Manager',
  None,
  '1962-02-18 00:00:00',
  '2002-08-14 00:00:00',
  '11120 Jasper Ave NW',
  'Edmonton',
  'AB',
  'Canada',
  'T5K 2N1',
  '+1 (780) 428-9482',
  '+1 (780) 428-3457',
  'andrew@chinookcorp.com'),
 (2,
  'Edwards',
  'Nancy',
  'Sales Manager',
  1,
  '1958-12-08 00:00:00',
  '2002-05-01 00:00:00',
  '825 8 Ave SW',
  'Calgary',
  'AB',
  'Canada',
  'T2P 2T3',
  '+1 (403) 262-3443',
  '+1 (403) 262-3322',
  'nancy@chinookcorp.com'),
 (3,
  'Peacock',
  'Jane',
  'Sales Support Agent',
  2,
  '1973-08-29 00:00:00',
  '2002-04-01 00:00:00',
  '1111 6 Ave SW',
  'Calgary',
  'AB',
  'Canada',
  'T2P 5M5',
  '+1 (403) 262-3443',
  '+1 (403) 262-6712',
  'jane@chinookcorp.com'),
 (4,
  'Park',
  'Margaret',
  'Sales Support Agent',
  2,
  '1947-09-19 00:00:00',
  '2003-05-03 00:00:00',
  '683 10 Street SW',
  'Calgary',
  'AB',
  'Canada',
  'T2P 5G3',
  '+1 (403) 263-4423',
  '+1 (403) 263-4289',
  'margaret@chinookcorp.com'),
 (5,
  'Johnson',
  'Steve',
  'Sales Support Agent',
  2,
  '1965-03-03 00:00:00',
  '2003-10-17 00:00:00',
  '7727B 41 Ave',
  'Calgary',
  'AB',
  'Canada',
  'T3B 1Y7',
  '1 (780) 836-9987',
  '1 (780) 836-9543',
  'steve@chinookcorp.com')]

In [31]:
# As you can see, the results are returned as a list of tuples. Each tuple corresponds to a row in the database that we accessed. Dealing with data this way is painful.
# We'd need to manually add column headers, and manually parse the data. Luckily, the pandas library has an easier way, which we'll look at in the next section.

In [32]:
df = pd.DataFrame(results)

In [33]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [34]:
# Before we move on, It's good practice to close Connection objects and Cursor objects that are open. This prevents the SQLite database from being locked. When a SQLite database is locked,
# you may be unable to update the database, and may get errors. We can close the Cursor and the Connection like this:

In [35]:
cur.close()
conn.close()

##### Using Pandas read_sql method

In [36]:
# We can use the pandas read_sql function to read the results of a SQL query directly into a pandas DataFrame. The code below will execute the same query that we just did, but it will return a
# DataFrame. It has several advantages over the query we add above:

# - It doesn't require us to create a Cursor object or call fetchall at the end.
# - It automatically reads in the names of the headers from the table.
# - It creates a DataFrame, so we can quickly explore the data.

In [37]:
conn = sqlite3.connect('chinook.db')

In [38]:
df = pd.read_sql('SELECT * FROM employees;', conn)

DatabaseError: Execution failed on sql 'SELECT * FROM employees;': no such table: employees

In [ ]:
df.head()

In [39]:
df = pd.read_sql('SELECT * FROM employees;', conn,
                 index_col='EmployeeId',
                 parse_dates=['BirthDate', 'HireDate'])

DatabaseError: Execution failed on sql 'SELECT * FROM employees;': no such table: employees

In [40]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      int64
 1   1       5 non-null      object
 2   2       5 non-null      object
 3   3       5 non-null      object
 4   4       4 non-null      float64
 5   5       5 non-null      object
 6   6       5 non-null      object
 7   7       5 non-null      object
 8   8       5 non-null      object
 9   9       5 non-null      object
 10  10      5 non-null      object
 11  11      5 non-null      object
 12  12      5 non-null      object
 13  13      5 non-null      object
 14  14      5 non-null      object
dtypes: float64(1), int64(1), object(13)
memory usage: 728.0+ bytes

In [42]:
df['ReportsTo'].isna().sum()

KeyError: 'ReportsTo'

In [ ]:
df[mean()'ReportsTo'].mean()

In [ ]:
df['ReportsTo'] > 1.75

In [ ]:
df['City'] = df['City'].astype('category')

In [ ]:
df.info()

##### Using Pandas read_sql_query Method

It turns out that the read_sql method we saw above is just a wrapper around read_sql_query and read_sql_table.

We can get the same result using read_sql_query method:

In [43]:
conn = sqlite3.connect('chinook.db')

In [44]:
df = pd.read_sql_query('SELECT * FROM employees LIMIT 5;', conn)

DatabaseError: Execution failed on sql 'SELECT * FROM employees LIMIT 5;': no such table: employees

In [45]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [46]:
df = pd.read_sql_query('SELECT * FROM employees;', conn,
                 index_col='EmployeeId',
                 parse_dates=['BirthDate', 'HireDate'])

DatabaseError: Execution failed on sql 'SELECT * FROM employees;': no such table: employees

In [47]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

##### Using read_sql_table method

read_sql_table is a useful function, but it works only with SQL Alchemy, A python SQL toolkit and Obect relational Mapper.
This is just a demonstartion of its usage where we read the whole employees table.

In [48]:
from sqlalchemy import create_engine

In [49]:
engine = create_engine('sqlite:///chinook.db')

In [50]:
connection = engine.connect()

In [51]:
df = pd.read_sql_table('employees', con=connection)

ValueError: Table employees not found

In [52]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [53]:
df = pd.read_sql_table('employees', con=connection,
                       index_col='EmployeeId',
                       parse_dates=['BirthDate', 'HireDate'])

ValueError: Table employees not found

In [54]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [55]:
connection.close()

##### Create tables from DataFrame objects

Finally we can persist DataFrame objects we've working on in a database using the pandas to_sql method. Although it is easy to implement, it could be a very slow process.

In [56]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [57]:
# Drop the table if needed

In [58]:
df.to_sql?  # here you can use if_exists: str='fail', you can use 'fail', 'replace', 'append'. Defaul is 'fail'

SyntaxError: invalid syntax (2919281664.py, line 1)

In [59]:
cur = conn.cursor()

In [60]:
cur.execute('DROP TABLE IF EXISTS employees2;')

In [61]:
cur.close()

In [62]:
df.to_sql('employees2', conn)

5

In [63]:
pd.read_sql_query('SELECT * FROM employees2;', conn).head()

,index,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

##### Custom Behaviour

In [64]:
pd.DataFrame().to_sql('employees2',
                      conn,
                      if_exists='replace')

0

In [65]:
pd.read_sql_query('SELECT * FROM employees2;', conn).head()

Empty DataFrame
Columns: [index]
Index: []

In [66]:
pd.read_sql_query('SELECT * FROM employees2;', conn).head()

Empty DataFrame
Columns: [index]
Index: []

##### Reading HTML FILES

In [67]:
import pandas as pd

Parsing raw HTML strings

In [68]:
html_string = """
<table>
    <thead>
      <tr>
        <th>Order date</th>
        <th>Region</th> 
        <th>Item</th>
        <th>Units</th>
        <th>Unit cost</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td>1/6/2018</td>
        <td>East</td> 
        <td>Pencil</td>
        <td>95</td>
        <td>1.99</td>
      </tr>
      <tr>
        <td>1/23/2018</td>
        <td>Central</td> 
        <td>Binder</td>
        <td>50</td>
        <td>19.99</td>
      </tr>
<tr>
        <td>2/9/2018</td>
        <td>Central</td> 
        <td>Pencil</td>
        <td>36</td>
        <td>4.99</td>
      </tr>
      <tr>
        <td>3/15/2018</td>
        <td>West</td> 
        <td>Pen</td>
        <td>27</td>
        <td>19.99</td>
      </tr>
    </tbody>
</table>
"""

In [69]:
from IPython.core.display import display, HTML
display(HTML(html_string))

C:\Users\user\AppData\Local\Temp\ipykernel_9320\149234223.py:1: DeprecationWarning: Importing display from IPython.core.display is deprecated since IPython 7.14, please import from IPython display
  from IPython.core.display import display, HTML

In [70]:
dfs = pd.read_html(html_string)

The read_html just returned one DataFrame object:

In [71]:
len(dfs)

1

In [72]:
df = dfs[0]
df

  Order date   Region    Item  Units  Unit cost
0   1/6/2018     East  Pencil     95       1.99
1  1/23/2018  Central  Binder     50      19.99
2   2/9/2018  Central  Pencil     36       4.99
3  3/15/2018     West     Pen     27      19.99

In [73]:
# Previous DataFrame looks quite similar to the HTML table, but now we have a DataFrame object, so we can apply any pandas operation we want to it.

In [74]:
df.shape

(4, 5)

In [75]:
df.loc[df['Region'] == 'Central']

  Order date   Region    Item  Units  Unit cost
1  1/23/2018  Central  Binder     50      19.99
2   2/9/2018  Central  Pencil     36       4.99

In [76]:
df.loc[df['Units'] > 35]

  Order date   Region    Item  Units  Unit cost
0   1/6/2018     East  Pencil     95       1.99
1  1/23/2018  Central  Binder     50      19.99
2   2/9/2018  Central  Pencil     36       4.99

Defining Header

Pandas will automatically find the header to use thanks to the tag.

But in many cases we'll find wrong or incomplete tables that make the read_html method parse the tables in a wrong way without the proper headers.

To fix them we can use the header parameter.

In [77]:
html_string =

SyntaxError: invalid syntax (1494536450.py, line 1)

In [78]:
pd.read_html(html_string) [0]

  Order date   Region    Item  Units  Unit cost
0   1/6/2018     East  Pencil     95       1.99
1  1/23/2018  Central  Binder     50      19.99
2   2/9/2018  Central  Pencil     36       4.99
3  3/15/2018     West     Pen     27      19.99

In this case, we'll need to pass the row number to use as header using the header parameter.

In [79]:
pd.read_html(html_string, header=0) [0]

  Order date   Region    Item  Units  Unit cost
0   1/6/2018     East  Pencil     95       1.99
1  1/23/2018  Central  Binder     50      19.99
2   2/9/2018  Central  Pencil     36       4.99
3  3/15/2018     West     Pen     27      19.99

##### Parsing HTML tables from the web

In [80]:
# Now that we know how read_html works, go one step beyond and try to parse HTML tables directly from an URL.
# To do that, we'll call the read_html method with an URL as parameter.

##### Simple Example

In [95]:
html_url = ('https://www.basketball-reference.com/leages/NBA_2019_per_game.html')

In [96]:
nba_tables = pd.read_html(html_url)

HTTPError: HTTP Error 404: Not Found

In [ ]:
len(nba_tables)

In [ ]:
# We'll work with only one table found:

In [ ]:
nba = nba_tables[0]

In [83]:
nba.head()

NameError: name 'nba' is not defined

##### Save To CSV File

In [84]:
Finally, we can also save our DataFrame as a CSV file

SyntaxError: invalid syntax (134548483.py, line 1)

In [85]:
exam_df

NameError: name 'exam_df' is not defined

We can simply generate a CSV string from our DataFrame:

In [86]:
exam_df.to_csv()

NameError: name 'exam_df' is not defined

Or specify a file path where we want a generated CSV code to be saved:

In [87]:
exam_df.to_csv('out.csv')

NameError: name 'exam_df' is not defined

In [88]:
pd.read_csv('out.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'out.csv'

In [ ]:
exam_df.to_csv('out.csv', index=None)

In [89]:
pd.read_csv('out.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'out.csv'

##### HOW TO USE SQLITE DATABASE WITH PYTHON

In [90]:
# using sql function to create table

connection = sqlite3.connect('data.db')

In [91]:
cursor = connection.cursor()

In [92]:
cursor.execute("CREATE TABLE STUDENT (Name text, Gender text)")
cursor.execute("INSERT INTO STUDENT VALUES('Max', 'M')") 
cursor.execute("INSERT INTO STUDENT VALUES('Sally', 'F')") 
cursor.execute("INSERT INTO STUDENT VALUES('Sarah', 'F')")

In [93]:
connection.commit()

In [94]:
#connection.close()

df2 = pd.read_sql('select * from student;', connection)
df2.head()

    Name Gender
0    Max      M
1  Sally      F
2  Sarah      F